function [PC] = hatchange(D2)
%监督分类
%多维随机向量
%特征变换
mul=double(D2);
[r ,c ,bands]=size(mul);
pixels = r*c;
% reshape成pixels*channel
mul = reshape(mul, [pixels,bands]);%改变为2维矩阵
KT=[0.290 0.2493 0.4806 0.5568 0.4438 0.1706;
            -0.2728 -0.2174 -0.5508 0.7221 0.0733 -0.1648;
            0.1446 0.1761 0.3322 0.3396 -0.6210 -0.4186;
            0.8461 -0.0731 -0.4640 -0.0032 -0.0492 0.0119;
            0.0549 -0.0232 0.0339 -0.1937 0.4162 -0.7823;
            0.1186 -0.8069 0.4094 0.0571 -0.0229 -0.0220]; 
PC = KT*mul';
